/*_______________________________________________________________________________________________________________________________________________________________________________________________________________________
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
▬▬▬.◙.▬▬▬
═▂▄▄▓▄▄▂
◢◤ █▀▀████▄▄▄◢◤
█▄ █ █▄ ███▀▀▀▀▀▀╬
◥█████◤
══╩══╩═
╬═╬
╬═╬
╬═╬    Just dropped down to say
╬═╬    *Mʀ Sʜᴀʙᴀɴ Hᴇʀ*
╬═╬   
╬═╬☻/
╬═╬/▌
╬═╬/  \

▇◤▔▔▔▔▔▔▔◥▇
▇▏◥▇◣┊◢▇◤▕▇
▇▏▃▆▅▎▅▆▃▕▇
▇▏╱▔▕▎▔▔╲▕▇
▇◣◣▃▅▎▅▃◢◢▇
▇▇◣◥▅▅▅◤◢▇▇
▇▇▇◣╲▇╱◢▇▇▇
╱╱┏╮╱╱╱╱╱╱╱╱╱╱
╱╱┃┃╱ ╱┳╱┓┳╭┛┳┓
▉━╯┗━╮┃╱┃┣┻╮┣╱
▉┈┈┈┈┈┃┻┛┛┻╱┗┗┛
▉╮┈┈┈┈┃▔▔▔▔▔▔▔▔
╱╰━━━╯
╱╱┏╮╱╱╱╱╱╱╱╱╱╱
╱╱┃┃╱ ╱┳╱┓┳╭┛┳┓
▉━╯┗━╮┃╱┃┣┻╮┣╱
▉┈┈┈┈┈┃┻┛┛┻╱┗┗┛
▉╮┈┈┈┈┃▔▔▔▔▔▔▔▔
╱╰━━━╯
╱╱┏╮╱╱╱╱╱╱╱╱╱╱
╱╱┃┃╱ ╱┳╱┓┳╭┛┳┓
▉━╯┗━╮┃╱┃┣┻╮┣╱
▉┈┈┈┈┈┃┻┛┛┻╱┗┗┛
▉╮┈┈┈┈┃▔▔▔▔▔▔▔▔
╱╰━━━╯
╱╱┏╮╱╱╱╱╱╱╱╱╱╱
╱╱┃┃╱ ╱┳╱┓┳╭┛┳┓
▉━╯┗━╮┃╱┃┣┻╮┣╱
▉┈┈┈┈┈┃┻┛┛┻╱┗┗┛
▉╮┈┈┈┈┃▔▔▔▔▔▔▔▔
╱╰━━━╯

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
© Copy coder alert ⚠
*/




const _0xe0f2c6=_0x3c5b;function _0x3c5b(_0x282c02,_0x54f339){const _0x1b5759=_0x1b57();return _0x3c5b=function(_0x3c5bf6,_0x519d4e){_0x3c5bf6=_0x3c5bf6-0x93;let _0x2b0599=_0x1b5759[_0x3c5bf6];return _0x2b0599;},_0x3c5b(_0x282c02,_0x54f339);}(function(_0x3863aa,_0x1086a3){const _0x56abb4=_0x3c5b,_0x25053a=_0x3863aa();while(!![]){try{const _0x568e69=parseInt(_0x56abb4(0x95))/0x1+parseInt(_0x56abb4(0xb2))/0x2*(-parseInt(_0x56abb4(0xa0))/0x3)+parseInt(_0x56abb4(0xa2))/0x4+-parseInt(_0x56abb4(0xa6))/0x5+-parseInt(_0x56abb4(0x94))/0x6*(parseInt(_0x56abb4(0xac))/0x7)+parseInt(_0x56abb4(0xb7))/0x8*(-parseInt(_0x56abb4(0xa3))/0x9)+-parseInt(_0x56abb4(0xa5))/0xa*(-parseInt(_0x56abb4(0x9d))/0xb);if(_0x568e69===_0x1086a3)break;else _0x25053a['push'](_0x25053a['shift']());}catch(_0x23f7cd){_0x25053a['push'](_0x25053a['shift']());}}}(_0x1b57,0x68e7c));const {cmd,commands}=require(_0xe0f2c6(0x93)),yts=require('yt-search'),axios=require(_0xe0f2c6(0xad));function _0x1b57(){const _0x4a6159=['.video\x20<keywords>','ytvideo2','11VRfqdw','video','*_🎧\x20AUDIO\x20FOUND\x20UNLOADING\x20YOUR\x20AUDIO\x20WAIT..._*','2655WOJFML','*Please\x20provide\x20a\x20video\x20tital\x20or\x20url*','828728qABTgr','63sdXEbw','result','21644270TmPdCm','1517195MskUaI','success','Download\x20videos\x20from\x20YouTube\x20by\x20searching\x20for\x20keywords.','video/mp4','yta2','music','91NgevGh','axios','error','video2','sendMessage','play2','1346vuHuQY','Download\x20audio\x20from\x20YouTube\x20by\x20searching\x20for\x20keywords.','url','length','videos','899064tbhsRA','https://api.gifted.my.id/api/download/dlmp4?apikey=gifted&url=','❌\x20No\x20results\x20found\x20for\x20\x22','get','data','song2','../command','333246OXbyep','465841rgFnjv','.play2\x20<keywords>','❌\x20Failed\x20to\x20fetch\x20video\x20for\x20\x22','>\x20©️\x20ᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴍʀsʜᴀʙᴀɴ⁴³²','https://api.gifted.my.id/api/download/dlmp3?apikey=gifted&url=','join'];_0x1b57=function(){return _0x4a6159;};return _0x1b57();}cmd({'pattern':_0xe0f2c6(0xaf),'alias':[_0xe0f2c6(0xbc),'ytv2',_0xe0f2c6(0x9c)],'react':'🎥','desc':_0xe0f2c6(0xa8),'category':_0xe0f2c6(0x9e),'use':_0xe0f2c6(0x9b),'filename':__filename},async(_0x17cf22,_0x247abf,_0x47b04c,{from:_0x51bb20,args:_0x863ceb,reply:_0x366dae})=>{const _0x347c46=_0xe0f2c6;try{const _0x3cefe3=_0x863ceb[_0x347c46(0x9a)]('\x20');if(!_0x3cefe3)return _0x366dae(_0x347c46(0xa1));_0x366dae('*_🎬\x20VIDEO\x20FOUND\x20UPLOADING\x20YOUR\x20VIDEO..._*');const _0x100120=await yts(_0x3cefe3);if(!_0x100120[_0x347c46(0xb6)]||_0x100120[_0x347c46(0xb6)][_0x347c46(0xb5)]===0x0)return _0x366dae(_0x347c46(0xb9)+_0x3cefe3+'\x22.');const _0xf3d48f=_0x100120[_0x347c46(0xb6)][0x0],_0x350a1a=_0xf3d48f[_0x347c46(0xb4)],_0xd61a4e=_0x347c46(0xb8)+_0x350a1a,_0x10fa5c=await axios[_0x347c46(0xba)](_0xd61a4e);if(!_0x10fa5c[_0x347c46(0xbb)][_0x347c46(0xa7)])return _0x366dae(_0x347c46(0x97)+_0x3cefe3+'\x22.');const {download_url:_0x620ada}=_0x10fa5c[_0x347c46(0xbb)][_0x347c46(0xa4)];await _0x17cf22['sendMessage'](_0x51bb20,{'video':{'url':_0x620ada},'mimetype':_0x347c46(0xa9),'caption':_0x347c46(0x98)},{'quoted':_0x247abf});}catch(_0x520747){console[_0x347c46(0xae)](_0x520747),_0x366dae('❌\x20An\x20error\x20occurred\x20while\x20processing\x20your\x20request.');}}),cmd({'pattern':_0xe0f2c6(0xb1),'alias':[_0xe0f2c6(0xaa),_0xe0f2c6(0xbc)],'react':'🎵','desc':_0xe0f2c6(0xb3),'category':_0xe0f2c6(0xab),'use':_0xe0f2c6(0x96),'filename':__filename},async(_0x176a1a,_0x1ae29a,_0x4ce632,{from:_0x39c34a,args:_0x2b4ffa,reply:_0x483a9e})=>{const _0x94ea1d=_0xe0f2c6;try{const _0x136960=_0x2b4ffa[_0x94ea1d(0x9a)]('\x20');if(!_0x136960)return _0x483a9e('*Please\x20provide\x20a\x20audio\x20tital\x20or\x20url*');_0x483a9e(_0x94ea1d(0x9f));const _0x2c0b46=await yts(_0x136960);if(!_0x2c0b46[_0x94ea1d(0xb6)]||_0x2c0b46[_0x94ea1d(0xb6)][_0x94ea1d(0xb5)]===0x0)return _0x483a9e(_0x94ea1d(0xb9)+_0x136960+'\x22.');const _0x4a9fa2=_0x2c0b46['videos'][0x0],_0x264e35=_0x4a9fa2[_0x94ea1d(0xb4)],_0x38d33d=_0x94ea1d(0x99)+_0x264e35,_0x24002e=await axios['get'](_0x38d33d);if(!_0x24002e[_0x94ea1d(0xbb)]['success'])return _0x483a9e('❌\x20Failed\x20to\x20fetch\x20audio\x20for\x20\x22'+_0x136960+'\x22.');const {download_url:_0x53b200}=_0x24002e[_0x94ea1d(0xbb)][_0x94ea1d(0xa4)];await _0x176a1a[_0x94ea1d(0xb0)](_0x39c34a,{'audio':{'url':_0x53b200},'mimetype':'audio/mp4','ptt':![]},{'quoted':_0x1ae29a});}catch(_0x4bb79e){console[_0x94ea1d(0xae)](_0x4bb79e),_0x483a9e('❌\x20An\x20error\x20occurred\x20while\x20processing\x20your\x20request.');}});
